HELYXcore-4.4.0/examples/tests/incompressible/movingCone/0/U
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    movingWall
    {
        type            movingWallVelocity;
        value           $internalField;
    }
    farFieldMoving
    {
        type            noSlip;
    }
    fixedWall
    {
        type            noSlip;
    }
    left
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
    farField
    {
        type            noSlip;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
    internal
    {
        type            internal;
    }
}


// ************************************************************************* //
