HELYXcore-4.4.0/examples/tests/incompressible/movingCone/0/p
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    movingWall
    {
        type            zeroGradient;
    }
    farFieldMoving
    {
        type            zeroGradient;
    }
    fixedWall
    {
        type            zeroGradient;
    }
    left
    {
        //type            totalPressure;
        //p0              $internalField;
        type            fixedValue;
        value           uniform 0;
    }
    farField
    {
        type            zeroGradient;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
    internal
    {
        type            internal;
    }
}


// ************************************************************************* //
